In [1]:
#call library
import pandas as pd
import numpy as np

In [ ]:
#but work on IDLE then install pandas
#pip install pandas

In [2]:
#Series : inbuilt function of pandas
#to create a 1D array
a=pd.Series([10,20,30,40,50])

In [3]:
print(a)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
#Access data from series
#access element at 2nd position
a[2]

30

In [6]:
#Retrieve the first 3 elements
print(a[:3])  #use slicing [start postion:stop position]
#here not mension start position means by default 0

0    10
1    20
2    30
dtype: int64

In [7]:
#Retrieve the last three element
print(a[-1:-3])
#start =-1 stop=-3-1 =-4  step=+1   -1+1=0

Series([], dtype: int64)

In [8]:
print(a[-1:-4:-1])

4    50
3    40
2    30
dtype: int64

In [9]:
print(a)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
print(a[-3:])  #start=-3 stop : till end  step =+1
# -3 then -3+1 =-2   -2+1=-1

2    30
3    40
4    50
dtype: int64

In [11]:
a=pd.Series([10,20,30,40,50],index=['A','B','C','D','F'])

In [12]:
print(a)

A    10
B    20
C    30
D    40
F    50
dtype: int64

In [13]:
#Retrieve a single element at location D
a['D']

40

In [15]:
#Retrieve multiple elements means Ath,Cth,and F th location 
a[['A','C','F']]  #2D expect [[]]

A    10
C    30
F    50
dtype: int64

In [ ]:
#2. DataFrame : to create a 2D(Two dimensional array) means to create a
# table means to hold data in the form of rows and columns

In [1]:
import pandas as pd
import numpy as np

In [2]:
#create dictionary of python
#Dictionary : key:value  key combination means column name/variable name   {}
d={"name":["Ram","Mohan","Govind","Suresh","Neena"],"Marks":[50,60,45,75,89],
   "City":["Mumbai","Indore","Mumbai","Pune","Indore"]}

In [3]:
print(d)

{'name': ['Ram', 'Mohan', 'Govind', 'Suresh', 'Neena'], 'Marks': [50, 60, 45, 75, 89], 'City': ['Mumbai', 'Indore', 'Mumbai', 'Pune', 'Indore']}

In [4]:
#converts this dictionary to dataframe
df=pd.DataFrame(d)  #df user defined dataframe

In [5]:
print(df)

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [8]:
#retrieve first 3 records
#head()  inbuilt function of pandas 
#head() : to display first 5 records from top
df.head(3)

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai

In [9]:
#tail() : to display last 5 records
#retrieve last 2 records
df.tail(2)

     name  Marks    City
3  Suresh     75    Pune
4   Neena     89  Indore

In [10]:
df

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [12]:
#Access only 3rd record then use indexing
df.iloc[3] #iloc ==>index location means location of row

name     Suresh
Marks        75
City       Pune
Name: 3, dtype: object

In [13]:
#Access name of all students
df["name"]

0       Ram
1     Mohan
2    Govind
3    Suresh
4     Neena
Name: name, dtype: object

In [14]:
df.name

0       Ram
1     Mohan
2    Govind
3    Suresh
4     Neena
Name: name, dtype: object

In [15]:
df

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [17]:
#retrieve multiple column then dataframe[[]]  : 2D array
#Retrieve name and city of all students
df[["name","City"]]

     name    City
0     Ram  Mumbai
1   Mohan  Indore
2  Govind  Mumbai
3  Suresh    Pune
4   Neena  Indore

In [18]:
df

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [19]:
#To retrieve particular cell's value
#cell means intersection of row and column
df.iloc[1,0]  #here 1 ->row's index and 0 column's index

'Mohan'

In [21]:
df.loc[1,"name"] #loc : given row index and give the colname

'Mohan'

In [22]:
df["name"][1]

'Mohan'

In [ ]:
#retrieve data through slicing  : means range
#dataframe.iloc[rowstart:rowstop,colstart:colstop]

In [23]:
df

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [24]:
#Retrieve all details(columns) of 1st and 2nd student
df.iloc[1:3,]

     name  Marks    City
1   Mohan     60  Indore
2  Govind     45  Mumbai

In [25]:
#retrieve only marks and city of 1st and 2nd students
df.iloc[1:3,1:]  #1:till end

   Marks    City
1     60  Indore
2     45  Mumbai

In [26]:
#retrieve name and marks of 1st to last student
df.iloc[1:,0:2]

     name  Marks
1   Mohan     60
2  Govind     45
3  Suresh     75
4   Neena     89

In [27]:
df.info()  # to display all information of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
name     5 non-null object
Marks    5 non-null int64
City     5 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [29]:
df

     name  Marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [28]:
df.describe()

           Marks
count   5.000000
mean   63.800000
std    18.157643
min    45.000000
25%    50.000000
50%    60.000000
75%    75.000000
max    89.000000

In [ ]:
#Extracting Data from various source 
# 1. clipboard : temporary memory of system

In [30]:
IPL=pd.read_clipboard() #IPL user defined dataframe
#read_clipboard() inbuilt function of pandas

In [31]:
IPL

,Year,Winner,Runner Up,Venue,Number of teams,Player of the Match,Player of the Series
0,2019,Mumbai Indians,Chennai Super Kings,Hyderabad,8,Jasprit Bumrah,Andre Russell
1,2018,Chennai Super Kings,Sunrisers Hyderabad,Mumbai,8,Shane Watson,Sunil Narine
2,2017,Mumbai Indians,Rising Pune Supergiants,Hyderabad,8,Krunal Pandya,Ben Stokes
3,2016,Sunrisers Hyderabad,Royal Challengers Bangalore,Bangalore,8,Ben Cutting,Virat Kohli
4,2015,Mumbai Indians,Chennai Super Kings,Kolkata,8,Rohit Sharma,Andre Russell
5,2014,Kolkata Knight Riders,Kings XI Punjab,Bangalore,8,Manish Pandey,Glenn Maxwell
6,2013,Mumbai Indians,Chennai Super Kings,Kolkata,9,Kieron Pollard,Shane Watson
7,2012,Kolkata Knight Riders,Chennai Super Kings,Chennai,9,Manvinder Bisla,Sunil Narine
8,2011,Chennai Super Kings,Royal Challengers Bangalore,Chennai,10,Murali Vijay,Chris Gayle
9,2010,Chennai Super Kings,Mumbai Indians,Mumbai,8,Suresh Raina,Sachin Tendulkar
10,2009,Deccan Chargers,Royal Challengers Bangalore,Johhanesburg,8,Anil Kumble,Adam Gilchrist
11,2008,Rajasthan Royals,Chennai Super Kings,Mumbai,8,Yusuf Pathan,Shane Watson

In [32]:
IPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
Year                    12 non-null int64
Winner                  12 non-null object
Runner Up               12 non-null object
Venue                   12 non-null object
Number of teams         12 non-null int64
Player of the Match     12 non-null object
Player of the Series    12 non-null object
dtypes: int64(2), object(5)
memory usage: 752.0+ bytes

In [33]:
#To display column names 
IPL.columns

Index(['Year', 'Winner', 'Runner Up', 'Venue', 'Number of teams',
       'Player of the Match', 'Player of the Series'],
      dtype='object')

In [34]:
#Retrieve first 5 records
IPL.head()

,Year,Winner,Runner Up,Venue,Number of teams,Player of the Match,Player of the Series
0,2019,Mumbai Indians,Chennai Super Kings,Hyderabad,8,Jasprit Bumrah,Andre Russell
1,2018,Chennai Super Kings,Sunrisers Hyderabad,Mumbai,8,Shane Watson,Sunil Narine
2,2017,Mumbai Indians,Rising Pune Supergiants,Hyderabad,8,Krunal Pandya,Ben Stokes
3,2016,Sunrisers Hyderabad,Royal Challengers Bangalore,Bangalore,8,Ben Cutting,Virat Kohli
4,2015,Mumbai Indians,Chennai Super Kings,Kolkata,8,Rohit Sharma,Andre Russell

In [36]:
#Retrieve last 5 records
IPL.tail()

,Year,Winner,Runner Up,Venue,Number of teams,Player of the Match,Player of the Series
7,2012,Kolkata Knight Riders,Chennai Super Kings,Chennai,9,Manvinder Bisla,Sunil Narine
8,2011,Chennai Super Kings,Royal Challengers Bangalore,Chennai,10,Murali Vijay,Chris Gayle
9,2010,Chennai Super Kings,Mumbai Indians,Mumbai,8,Suresh Raina,Sachin Tendulkar
10,2009,Deccan Chargers,Royal Challengers Bangalore,Johhanesburg,8,Anil Kumble,Adam Gilchrist
11,2008,Rajasthan Royals,Chennai Super Kings,Mumbai,8,Yusuf Pathan,Shane Watson

In [37]:
#only display the value of Winner column
IPL["Winner"]

0            Mumbai Indians
1       Chennai Super Kings
2            Mumbai Indians
3       Sunrisers Hyderabad
4            Mumbai Indians
5     Kolkata Knight Riders
6            Mumbai Indians
7     Kolkata Knight Riders
8       Chennai Super Kings
9       Chennai Super Kings
10          Deccan Chargers
11         Rajasthan Royals
Name: Winner, dtype: object

In [39]:
#only display winner team one time then use inbuilt fucntion unique()
print(IPL["Winner"].unique())

['Mumbai Indians' 'Chennai Super Kings' 'Sunrisers Hyderabad'
 'Kolkata Knight Riders' 'Deccan Chargers' 'Rajasthan Royals']

In [40]:
#how many times repeating means winner
IPL["Winner"].value_counts()

Mumbai Indians           4
Chennai Super Kings      3
Kolkata Knight Riders    2
Deccan Chargers          1
Rajasthan Royals         1
Sunrisers Hyderabad      1
Name: Winner, dtype: int64

In [42]:
#conditional filtering
#means to retrieve record according to conditions
#to display all details of those team whose winner=Mumbai Indians
IPL[IPL["Winner"]=="Mumbai Indians"]

,Year,Winner,Runner Up,Venue,Number of teams,Player of the Match,Player of the Series
0,2019,Mumbai Indians,Chennai Super Kings,Hyderabad,8,Jasprit Bumrah,Andre Russell
2,2017,Mumbai Indians,Rising Pune Supergiants,Hyderabad,8,Krunal Pandya,Ben Stokes
4,2015,Mumbai Indians,Chennai Super Kings,Kolkata,8,Rohit Sharma,Andre Russell
6,2013,Mumbai Indians,Chennai Super Kings,Kolkata,9,Kieron Pollard,Shane Watson